import 'package:flutter/material.dart';

import '../views/pages/diagnosis_result/DesignResultPage.dart';
import '../views/pages/diagnosis_result/HealthResultPage.dart';

class ResultPage {
  void resultPage(BuildContext context, String disease_name, String imagePath) {
    if (disease_name == 'صدأ التفاح الارز') {
      Navigator.push(
        context,
        MaterialPageRoute(
            builder: (context) => Diagnosis([
                  'بقع الأوراق هي أول صفراء ثم تتحول إلى برتقالي-أحمر فاتح ، غالبًا بحد أحمر فاتح.',
                  'تتشكل نقاط سوداء صغيرة ومرتفعة في وسط بقع الأوراق على سطح الورقة العلوي عندما تنضج بقع الأوراق.',
                  'أنابيب فطرية صغيرة تشبه الأصابع من صدأ تفاح أرز تخرج من السطح السفلي للورقة.',
                ], [
                  'نادرًا ما تتشكل بقع غير منتظمة خضراء إلى بنية اللون مع نقاط سوداء على سطح الفاكهة. لا تمتد بقع الفاكهة إلى عمق الفاكهة.'
                ], [
                  'درجات الحرارة الباردة (60-80 درجة فهرنهايت) والرطوبة العالية تساعد على تطور المرض.'
                ], [
                  'مزيج من الكبريت والبيريثرين ، يتوفر هذان المركبان الكلاسيكيان في رذاذ مخلوط مسبقًا يُعرف باسم Bonide® Orchard Spray. يسيطر هذا الرذاذ على الفطريات والحشرات وهو معتمد عضويًا. احذر من أنه يمكن أن يضر الحشرات النافعة في المنطقة إلى جانب الآفات.',
                  'يمكنك معالجتها بمحلول من النحاس أربع مرات على الأقل. استخدم 0.5 إلى 2.0 أوقية من النحاس لكل جالون من الماء. من الأفضل أن تبدأ بهذا العلاج كوسيلة وقائية في وقت مبكر من الربيع قبل أن تظهر على الأشجار علامات العدوى ، أو بمجرد أن تبدأ الأعراض في الظهور.',
                  'مبيدات الفطريات الحيوية: توجد سلالة من البكتيريا فعالة في علاج صدأ تفاح الأرز على أشجار التفاح. إنها سلالة خاصة من العصوية الرقيقة.'
                ], [
                  'assets/cedar.jpg',
                  'assets/cedar2.jpg',
                  'assets/cedar3.jpg'
                ], 'صدأ التفاح الارز', imagePath,
                    'Gymnosporangium juniperi-virginianae')),
      );
    } else if (disease_name == 'لفحة أوراق الذرة الشمالية') {
      Navigator.push(
        context,
        MaterialPageRoute(
            builder: (context) =>
                // GrapeLeafBlight( title: disease_name, )

                Diagnosis([
                  'تتحوّل آفات لفحة أوراق الذرة الشمالية إلى اللون الرمادي الباهت حيث تتضخم إلى 1 إلى 6 بوصات أو أكثر ، الآفات المميزة على شكل سيجار غير المقيدة بأوردة الأوراق تجعل مرض اللفحة الشمالية لأوراق الذرة (NCLB) أحد أسهل الأمراض التي يمكن تحديدها.',
                  'تنتج الآفات جراثيم رمادية داكنة ، عادة على السطح السفلي للورقة ، مما يعطي الآفات مظهرًا "متسخًا".',
                  'كلما اتسعت العديد من الآفات وتلتحم ، قد يتم تغطية الأوراق بأكملها أو مناطق الأوراق.'
                ], [
                  'في أواخر الموسم ، قد تبدو النباتات وكأنها قد ماتت بسبب الصقيع المبكر.',
                  'قد تظهر الآفات الموجودة على المنتجات التي تحتوي على جينات مقاومة على شكل خطوط طويلة مصفرة اللون ، والتي يمكن الخلط بينها وبين ذبول ستيوارت أو ذبول جوس.'
                ], [
                  'تنتشر الجراثيم عن طريق رذاذ المطر والتيارات الهوائية إلى أوراق نباتات المحاصيل الجديدة في الربيع وأوائل الصيف. قد تنقل الرياح الأبواغ لمسافات طويلة.',
                  'تحدث العدوى عند وجود الماء الحر على سطح الورقة لمدة 6 إلى 18 ساعة ودرجة الحرارة من 65 إلى 80 فهرنهايت'
                ], [
                  'إذا كانت مستويات المرض مرتفعة في الموسم السابق ، فيمكن رش مبيدات الفطريات النحاسية السائلة لإعاقة نمو الفطريات على الشجرة خلال فصل الشتاء.',
                  'بخاخات الكبريت فعالة جزئيًا فقط في الذرة. ومع ذلك ، فإن المحاليل التي تحتوي على الكبريت والبيريثرين متوفرة للتحكم العضوي للمرض خلال موسم النمو.',
                  'ضع في اعتبارك دائمًا نهجًا متكاملًا مع التدابير الوقائية جنبًا إلى جنب مع العلاجات البيولوجية إذا كانت متوفرة.',
                  'يمكن رش مبيدات الفطريات الوقائية مثل الدودان أو الكابتان أو الديناثيون حول استراحة البراعم لتجنب المرض.',
                  'بمجرد اكتشافه ، يمكن استخدام مبيدات الفطريات المعتمدة على ديفينوكونازول أو ميكلوبوتانيل أو كبريت للسيطرة على تطور الفطريات.',
                ], [
                  'assets/ncorn.JPG',
                  'assets/ncorn2.jpg',
                  'assets/ncorn3.png'
                ], 'لفحة أوراق الذرة الشمالية', imagePath,
                    'إكسيروهيلومتورسيكون')),
      );
    } else if (disease_name == 'لفحة ورق العنب') {
      Navigator.push(
        context,
        MaterialPageRoute(
            builder: (context) =>
                // GrapeLeafBlight( title: disease_name, )

                Diagnosis([
                  'على سطح الورقة ، سنرى آفات غير منتظمة الشكل (بقطر من 2 إلى 25 مم).',
                  'في البداية ، تكون الآفات حمراء باهتة إلى بنية اللون ثم تتحول إلى اللون الأسود لاحقًا.',
                  'إذا كان المرض شديدًا ، فقد تتجمع هذه الآفات.'
                ], [
                  'على ثمار العنب ، يمكننا أن نرى أعراضًا مشابهة للعفن الأسود لكن العناقيد بأكملها ستنهار.'
                ], [
                  'شائع في العنب الاستوائي وشبه الاستوائي.',
                  'يظهر المرض في أواخر الموسم.'
                ], [
                  'أكثر مبيدات الفطريات استخدامًا للسيطرة على أمراض العنب هو خليط بوردو ، وهو مبيد فطري نحاسي. ومع ذلك ، مثل جميع مركبات النحاس ، قد ينتج عن مبيد الفطريات هذا أعراض سمية في أنسجة النباتات الصغيرة ، وقد يؤدي العمل التآكل لمبيد الفطريات إلى الإضرار ببنية الكرمة.'
                ], [
                  'assets/grapebli.jpg',
                  'assets/grapebli2.jpg',
                  'assets/grapebli3.jpg'
                ], 'لفحة ورق العنب (بقعة أوراق إيزاريوبسيس)', imagePath,
                    'Pseudocercospora Vitis')),
      );
    } else if (disease_name == 'اللفحة المبكرة في البطاطس') {
      Navigator.push(
        context,
        MaterialPageRoute(
            builder: (context) =>
                // PotatoEarlyBlight(disease_name, image_path)
                //
                Diagnosis([
                  'تظهر أعراض اللفحة المبكرة على الأوراق القديمة والساق والفواكه. تظهر البقع الرمادية إلى البنية على الأوراق وتنمو تدريجياً بطريقة متحدة المركز حول مركز واضح - تشكيل "بولس" المميز. هذه الآفات محاطة بهالة صفراء زاهية.',
                  'مع تقدم المرض ، قد تتحول الأوراق بأكملها إلى اخضرارها وتتساقط ، مما يؤدي إلى تساقط الأوراق بشكل كبير.'
                ], [
                  'قد تظهر البقع الرمادية إلى البنية على الثمار.',
                  'سيكون للدرنات آفات رمادية داكنة إلى أرجوانية ، دائرية إلى غير منتظمة مع حواف مرتفعة.',
                  ' إذا تم تقطيع البطاطس إلى شرائح مفتوحة ، فسيصبح لونها بنيًا وجافًا وفلينيًا أو جلديًا.',
                  ' إذا كان المرض في مراحله المتقدمة ، فإن لحم الدرنات يبدو غارقًا في الماء ولونه أصفر إلى أصفر مخضر.',
                  'تعفن الثمار وأحيانًا يتبعها السقوط.'
                ], [
                  'غالبًا ما تصاب الأوراق السفلية بالعدوى عند ملامستها للتربة الملوثة.',
                  'تؤدي درجات الحرارة الدافئة (24-29 درجة مئوية) والرطوبة العالية (90٪) إلى تطور المرض.',
                  'تعزز فترة رطوبة طويلة (أو طقس رطب / جاف بالتناوب) إنتاج الجراثيم ، والتي قد تنتشر عن طريق الرياح ، أو رش المطر ، أو الري العلوي.',
                  'الدرنات التي يتم حصادها خضراء أو في ظروف رطبة معرضة بشكل خاص للعدوى.',
                  'غالبًا ما تضرب بعد فترة من هطول الأمطار الغزيرة وتكون مدمرة بشكل خاص في المناطق الاستوائية وشبه الاستوائية.'
                ], [
                  'يمكن أن يعالج هذا المرض استخدام المنتجات القائمة على Bacillus subtilis أو مبيدات الفطريات القائمة على النحاس والمسجلة كعضوية.',
                  'هناك العديد من مبيدات الفطريات في السوق لمكافحة اللفحة المبكرة. يمكن استخدام مبيدات الفطريات التي تعتمد على أو مزيج من أزوكسيستروبين ، وبيراكلوستروبين ، وديفينوكونازول ، وبوسكاليد ، وكلوروثالونيل ، وفيناميدون ، ومانيب ، ومانكوزيب ، وتريفلوكسيستروبين ، وزيرام. يوصى بتناوب المركبات الكيميائية المختلفة.',
                  'ضع العلاجات على الفور ، مع مراعاة الظروف الجوية.',
                  'تحقق بعناية من فترة ما قبل الحصاد التي يمكنك خلالها الحصاد بأمان بعد تطبيق هذه المنتجات.'
                ], [
                  'assets/16.jpg',
                  'assets/17.jpg',
                  'assets/18.jpg'
                ], 'اللفحة المبكرة في البطاطس', imagePath, 'النوباء سولاني')),
      );
    } else if (disease_name == 'تعفن العنب الأسود') {
      Navigator.push(
        context,
        MaterialPageRoute(
            builder: (context) => Diagnosis([
                  'تظهر أعراض العفن الأسود أولاً على شكل بقع صفراء صغيرة على الأوراق. البقع المتضخمة (الآفات) لها حدود حمراء بنية داكنة مع مراكز بنية داكنة إلى البني الداكن. مع تطور العدوى ، تظهر نقاط سوداء صغيرة في الآفة ، عادة في شكل حلقة بالقرب من حدود الآفة.'
                ], [
                  'عادة لا تبدأ أعراض الفاكهة في الظهور حتى يصبح حجم حبة العنب أو أكبر.',
                  'تتشكل بقع بنية على الفاكهة ثم تبدأ الثمرة في الذبول وتتحول إلى اللون الأسود.',
                  'سوف تذبل التوت في النهاية إلى هياكل تشبه الزبيب تسمى المومياوات.'
                ], [
                  'يساعد المناخ الدافئ والرطب مع فترات الأمطار الطويلة والطقس الغائم على تطور المرض.'
                ], [
                  'يعتبر مانكوزب وزيرام فعالين للغاية ضد العفن الأسود. نظرًا لأن مبيدات الفطريات هذه مواد وقائية تمامًا ، يجب استخدامها قبل أن يصيب الفطر النبات أو يدخله. أنها تحمي الفاكهة وأوراق الشجر عن طريق منع إنبات الجراثيم. لن يوقفوا تطور الآفة بعد حدوث العدوى.'
                ], [
                  'assets/grapeblack.jpg',
                  'assets/grapeblack2.jpg',
                  'assets/grapeblack3.jpg'
                ], 'تعفن العنب الأسود', imagePath,
                    'Guignardia bidwellii (Ellis)')),
      );
    } else if (disease_name == 'حرق أوراق الفراولة') {
      Navigator.push(
        context,
        MaterialPageRoute(
            builder: (context) =>
                //  TomatoLateBlight(disease_name, image_path)

                Diagnosis([
                  'تتشابه أعراض حرق الأوراق مع المراحل المبكرة من بقع الأوراق الشائعة (Mycosphaerella) ، مع وجود بقع أرجوانية داكنة غير منتظمة منتشرة على سطح الورقة العلوي. مع اتساع البقع ، تبدأ في الظهور مثل قطرات القطران ، وهي في الواقع تراكمات لأجسام الثمر السوداء (acervuli) للفطر.',
                  'تظل مراكز البقع أرجوانية (في بقعة أوراق Mycosphaerella فهي بيضاء) ولا توجد حدود آفة محددة جيدًا. في حالات العدوى الشديدة ، تتحد هذه المناطق ويتحول النسيج الموجود بين الآفات غالبًا إلى اللون الأرجواني إلى الأحمر الفاتح الذي يعتمد على الصنف أو درجة الحرارة أو عوامل أخرى.',
                  'تتحول الأوراق في النهاية إلى اللون البني وتجف وتتجعد عند الحواف مما يعطي الورقة مظهرًا محترقًا. قد تضعف النباتات ويقل عدد وحيوية التيجان.'
                ], [
                  'العدوى تهيئ النباتات لإجهاد الشتاء والجفاف. في حالات الإصابة الشديدة ، قد تموت الأزهار والفاكهة. بشكل عام ، يمكن أن يكون هناك انخفاض كبير في العائد في أنظمة الصفوف غير اللامعة.'
                ], [
                  'في أنظمة الإنتاج السنوية ، يمكن أن يأتي المرض في عمليات زرع أو نصائح ويتراكم في مرحلة إنتاج المكونات في أوائل الخريف في الحقل. ومع ذلك ، فإن العامل الممرض لا يسبب الضرر في الربيع التالي.',
                  'يتم إنتاج الأبواغ في الربيع ومنتصف الصيف على الأسطح المنخفضة للأوراق من الأوراق الميتة المصابة في العام السابق وتنتشر عن طريق الرياح والأمطار المتساقطة.',
                  'يُفضل زيادة المرض عن طريق رطوبة الأوراق أثناء الطقس الدافئ (68-86 درجة فهرنهايت) ومن المرجح أن تصبح أكثر أهمية في المزارع القديمة للأصناف المعرضة للإصابة. يتم إنتاج جيل واحد من الأبواغ الأسكورية (جراثيم البداية) والعديد من الأجيال المتداخلة من الكونيديا (الأبواغ) كل عام.'
                ], [
                  'استخدام الأسمدة النيتروجينية والنحاسية.'
                ], [
                  'assets/straw1.jpg',
                  'assets/straw2.jpg',
                  'assets/straw3.jpg'
                ], 'حرق أوراق الفراولة', imagePath, 'Diplocarpon earlianum')),
      );
    } else if (disease_name == 'اللفحة المتأخرة في الطماطم') {
      Navigator.push(
        context,
        MaterialPageRoute(
            builder: (context) =>
                //  TomatoLateBlight(disease_name, image_path)

                Diagnosis([
                  'تظهر بقع خضراء بنية على هوامش الأوراق وقممها. في وقت لاحق ، تتحول مساحات كبيرة من الأوراق إلى اللون البني في النهاية.',
                  'أثناء الطقس الرطب ، قد يتم تغطية الآفات الموجودة على الجانب السفلي من الأوراق بنمو متعفن رمادي إلى أبيض ، مما يسهل التمييز بين أنسجة الأوراق السليمة والميتة.',
                  'تتحول أوراق الشجر إلى اللون البني وتجعد وتجف مع تقدم المرض.',
                  'في بعض الحالات ، تظهر البقع البنية المحددة بشكل حاد والغطاء الأبيض أيضًا على السيقان والفروع والأعناق.'
                ], [
                  'تظهر بقع رمادية خضراء إلى بنية متسخة ومتجعدة على الفاكهة. في هذه البقع ، يكون لب الثمرة صلبًا.'
                ], [
                  'يدخل الفطر النبات عن طريق الجروح والتمزق في الجلد.',
                  'تعتبر درجة الحرارة والرطوبة من أهم العوامل البيئية التي تؤثر على تطور المرض.',
                  'تنمو فطريات اللفحة المتأخرة بشكل أفضل في الرطوبة النسبية العالية (حوالي 90٪) وفي درجات حرارة تتراوح من 18 إلى 26 درجة مئوية. يمكن لطقس الصيف الحار والجاف أن يوقف انتشار المرض.'
                ], [
                  'في هذه المرحلة ، لا توجد سيطرة بيولوجية على الفعالية المعروفة ضد اللفحة المتأخرة. لتجنب الانتشار ، قم بإزالة النباتات الموجودة حول المنطقة المصابة وتدميرها على الفور ولا تقم بتسميد المواد النباتية المصابة.',
                  'استخدم بخاخات مبيدات الفطريات على أساس منديبروباميد ، كلوروثالونيل ، فلوازينام ، مانكوزيب لمكافحة اللفحة المتأخرة.',
                  'عادة ما تكون هناك حاجة لمبيدات الفطريات فقط إذا ظهر المرض خلال فترة من السنة عندما يكون من المحتمل هطول الأمطار أو يمارس الري العلوي.'
                ], [
                  'assets/latetomato.jpg',
                  'assets/latetomato2.jpeg',
                  'assets/latetomato3.jpg'
                ], 'اللفحة المتأخرة في الطماطم', imagePath,
                    'إنفستان فيتوفثورا')),
      );
    } else if (disease_name == 'نبات صحي' ||
        disease_name == "Apple Healthy" ||
        disease_name == "blueberry healthy" ||
        disease_name == "cherry including sour healthy" ||
        disease_name == "Corn Health" ||
        disease_name == "Grape Healthy " ||
        disease_name == "peach healthy" ||
        disease_name == "pepper bell healthy" ||
        disease_name == "Potato Healthy" ||
        disease_name == "raspberry healthy" ||
        disease_name == "soybean healthyy" ||
        disease_name == "Strawberry Healthy" ||
        disease_name == "Tomato Healthy") {
      Navigator.push(
        context,
        MaterialPageRoute(
            builder: (context) =>
                // Healthy(title: disease_name,)
                HealthyResult(imagePath)),
      );
    } else if (disease_name == 'كائن غريب') {
      showErrorProcessing(context);
      print(
          '///////////////////////////////This image is bacccccccccckgroooooooooooound............');
    } else {
      print('showErrorProcessing(context) elsee');
      showErrorProcessing(context);
    }
  }

  void showErrorProcessing(BuildContext context) {
    AlertDialog dialogWithImage = AlertDialog(
      backgroundColor: Colors.white,
      content: Container(
        width: MediaQuery.of(context).size.width,
        child: Column(
          mainAxisSize: MainAxisSize.min,
          crossAxisAlignment: CrossAxisAlignment.center,
          children: [
            Stack(
              alignment: Alignment.center,
              children: [
                Container(
                    height: 120, color: Color.fromARGB(255, 42, 153, 140)),
                Column(
                  children: [
                    Icon(Icons.warning, color: Colors.white, size: 32),
                    // 8.height,
                    Text("فشل التعرف!",
                        textAlign: TextAlign.center,
                        style: TextStyle(
                            color: Colors.white,
                            fontSize: 20,
                            fontWeight: FontWeight.bold)),
                  ],
                )
              ],
            ),
            SizedBox(
              height: 25,
            ),
            Padding(
              padding: EdgeInsets.only(left: 16, right: 16),
              child: Text(
                  "تأكد من أن الصورة هي لورقة النبات، وقم بتركيز الكاميرا بشكل واضح على الضرر.",
                  style: TextStyle(
                      color: Colors.black,
                      fontSize: 16,
                      fontWeight: FontWeight.bold)),
            ),
            SizedBox(
              height: 25,
            ),
            GestureDetector(
              onTap: () {
                Navigator.of(context, rootNavigator: true).pop('dialog');
              },
              child: Container(
                decoration: BoxDecoration(
                    color: Color.fromARGB(255, 42, 153, 140),
                    borderRadius: BorderRadius.circular(5)),
                padding: EdgeInsets.fromLTRB(16, 8, 16, 8),
                child: Text("التقط صورة أخرى",
                    style: TextStyle(color: Colors.white, fontSize: 16)),
              ),
            ),
            SizedBox(
              height: 15,
            ),
          ],
        ),
      ),
      contentPadding: EdgeInsets.all(0),
    );
    showDialog(
        context: context, builder: (BuildContext context) => dialogWithImage);
  }
}
